Repository: SangChu0702/ConsoleApp
Catalog: Resoucres/Languages/Strings.*.resx
Languages: vi

source: Read VIN
vi: Đọc VIN

# User_Department
source: Department
vi: Bộ phận

# User_Information
source: User Infomation
vi: Thông tin người dùng

# User_Name
source: Name
vi: Tên

# CheckTimer_Title
source: Can't connect with server
vi: Không thể kết nối với máy chủ

# CheckTimer_Content
source: Application may be not working, please close app and try again
vi: Ứng dụng có thể không hoạt động, vui lòng tắt phần mềm và thử lại

# Logout_Title
source: Log Out
vi: Đăng xuất

# Logout_Content
source: You need to login again to use application, do you want to continue?
vi: Bạn cần đăng nhập để có thể sử dụng phần mềm, bạn có muốn tiếp tục không?

# Connect_Title
source: Device connected
vi: Thiết bị đã được kết nối

# Disconnect_Title
source: Device disconnected
vi: Thiết bị đã ngắt kết nối

source: Connect
vi: Kết nối

source: Disconnect
vi: Ngắt kết nối

# ConnectFail_Title
source: Failed to connect device
vi: Không thể kết nối thiết bị

# Select_Title
source: Please select device port
vi: Vui lòng chọn thiết bị

source: Model
vi: Mẫu xe

source: Help
vi: Trợ giúp

source: Language
vi: Ngôn ngữ

source: Notifications
vi: Thông báo

source: Select device
vi: Chọn thiết bị

# ECU_not_resp
source: ECU not responded
vi: ECU không phản hồi

source: ECU without DTC
vi: ECU không có DTC

source: ECU with DTC
vi: ECU có DTC

source: Health Check
vi: Kiểm tra xe

source: Vehicle DTC
vi: DTC của xe

source: Save Report
vi: Lưu báo cáo

# See_ECU_topology
source: Connect vehicle to see ECU topology
vi: Kết nối với xe để xem cấu trúc các ECU

source: Description
vi: Mô tả

# No_Header
source: No
vi: STT

source: Refresh
vi: Làm mới

source: Failure Type
vi: Kiểu lỗi

source: Name
vi: Tên

source: Status
vi: Trạng thái

source: Details
vi: Chi tiết

source: Clear DTC
vi: Xóa DTC

source: ECU Info
vi: Thông tin ECU

source: DTC Info
vi: Thông tin DTC

source: Data Flow
vi: Luồng dữ liệu

source: IO Control
vi: Điều khiển IO

source: Services
vi: Dịch vụ

source: Back
vi: Quay lại

source: Parameter
vi: Tham số

source: Value
vi: Giá trị

source: Unit
vi: Đơn vị

source: Action
vi: Thao tác

source: Run
vi: Chạy

source: Programming
vi: Nạp chương trình

source: Write VIN
vi: Ghi VIN

source: Reset
vi: Khởi động lại

source: Write Hardware
vi: Ghi mã phần cứng

source: HV Battery Health Report
vi: Tình trạng pin điện áp cao

# TPMS_ID
source: TPMS ID (read and write)
vi: TPMS ID (đọc và ghi)

source: BAS Calibration
vi: Hiệu chỉnh BAS

source: Read CDS Coding
vi: Đọc tính năng CDS

source: Write CDS Coding
vi: Ghi tính năng CDS

source: Read VOD Coding
vi: Đọc tính năng VOD

source: Write VOD Coding
vi: Ghi tính năng VOD

source: Provision
vi: Định danh (Provision)

# Lock_Provision
source: Lock Provision Data
vi: Khóa dữ liệu định danh (Lock Provision)

source: Write FRS Number
vi: Ghi mã FRS

source: SAS Calibration
vi: Hiệu chỉnh SAS

# Connect_Required
source: Please connect device first
vi: Vui lòng kết nối thiết bị trước

# Vincode_Miss_Match_Title
source: VinCode miss match between MHU and BCM
vi: Mã Vin không giống nhau giữa MHU và BCM

# Vincode_Miss_Match_Content
source: You need to enter the expected Vincode
vi: Vui lòng nhập Vincode mong muốn

# Get_Latest_VDSA_Fail
source: Unable to get latest VDSA version
vi: Không thể lấy phiên bản VDSA mới nhất từ máy chủ

# Not_Found_Update_Tool
source: Not found VDSA update tool
vi: Không tìm thấy phần mềm cập nhập VDSA

# Please_Report
source: Please report to our support team
vi: Vui lòng báo cáo vấn đề này cho đội hỗ trợ của chúng tôi

# Update_Automatic
source: The app will update automatically after closing
vi: Phần mềm sẽ cập nhập tự động khi tắt

source: Update Fail
vi: Cập nhập lỗi

# Download_Package_Fail
source: Download update package failed
vi: Lỗi khi tải bản cập nhập

# Get_Access_Fail
source: Unable to get access from server
vi: Không thể lấy quyền truy cập của bạn từ máy chủ

# Select_Model_Required
source: Please select model first
vi: Vui lòng chọn mẫu xe trước

# Miss_Data
source: Missing database of
vi: Thiếu dữ liệu của

# Get_Veh_Info_Fail
source: Unable to get vehicle information from server
vi: Không thể lấy dữ liệu của xe từ máy chủ

# Get_FRS_Fail
source: Unable to get latest FRS from server
vi: Không thể lấy thông tin FRS mới nhất từ máy chủ

# New_Ver_Available
source: New version is available
vi: Phiên bản mới đã sẵn sàng

# Install_Required
source: Would you like to install it now
vi: Bạn có muốn cài đặt ngay không

source: Loading
vi: Đang tải

# WriteFRS_Step1_Pass
source: Latest FRS have been got from server
vi: Lấy thành công thông tin FRS mới nhất từ máy chủ

# WriteFRS_Step1_Fail
source: Fail to get latest FRS from server
vi: Không lấy được thông tin FRS mới nhất từ máy chủ

# WriteFRS_Step2_Pass
source: Write FRS Number complete
vi: Ghi FRS thành công

# WriteFRS_Step2_Fail
source: Fail to write FRS number
vi: Ghi FRS không thành công

source: Reason
vi: Lý do

# WriteFRS_Step2_Running
source: Writing FRS number
vi: Đang ghi mã FRS

source: Flash Vehicle
vi: CNPM xe

# Programming_Desc
source: The software update process is to upgrade the ECU's software to the latest version
vi: Quá trình cập nhật phần mềm là để nâng cấp phần mềm của ECU lên phiên bản phần mềm mới nhất

source: Requirement
vi: Yêu cầu

# Programming_Req
source: Ensure that the computer is connected to a 12V power supply, has sufficient power, and is not shut down or locked during the software update process. The vehicle must be maintained at 12V and remain stationary in Park (P) mode
vi: Đảm bảo máy tính được kết nối với máy sạc 12V, máy tính đủ nguồn và không tắt, khóa màn hình trong quá trình cập nhật phần mềm đang diễn ra, Xe được duy trì điện áp 12V và ở trạng thái đứng yên (P)

source: Condition
vi: Điều kiện

# Programming_MHU_req
source: Please connect the ECU to the computer using a USB cable
vi: Kết nối ECU với máy tính bằng dây kết nối USB

# Programming_MHU_MainReq
source: Do not interact with the screen under any circumstances while the application is running
vi: Tuyệt đối không thao tác trên màn hình trong quá trình ứng dụng đang chạy

source: Select language
vi: Chọn ngôn ngữ

source: Change
vi: Thay đổi

source: Reading VIN
vi: Đọc VIN
